In [1]:
import pandas as pd #importing Pandas module

data = {'Name':['Jai', 'Prince', 'Gaurav', 'Anuj'],
		    'Age':[27, 24, 22, 32],
		    'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Address':['Delhi', 'kanpur', 'Mumbai', 'Allahabad']} #Added a new column to data


df = pd.DataFrame(data) #Converting the dictionary to DataFrame

df #to print DataFrame

     Name  Age Qualification    Address
0     Jai   27           Msc      Delhi
1  Prince   24            MA     kanpur
2  Gaurav   22           MCA     Mumbai
3    Anuj   32           Phd  Allahabad